// ------- S1 -------
// Forms =>> type = تحديد نوع الإدخال value = تحديد قيمة الإدخال placeholder = كتابة ملاحظه او توضيح داخل مكان الإدخال name = تحديد أسم الإدخال 
// Audio / Video =>> controls = لأظهار شريط الأدوات للمديا width / hight = لتحديد عرض وارتفاع الميديا source = لتحديد مكان الميديا  type = لتحديد نوع البيانات الخاصة بلإدخال
// Semantics =>> اكواد تسهل الكتابة للكود والقرائه للمتصفح والمبرمج article / footer / main / header / nav / section
// Tables =>> لازم اعرف ان عندي Table / تقسيم الجدول لصفوف وأعمده ورأس thead = رأس الجدول tr  = ده تعريف صف للجدول th = تعريف حقل داخل الجدول انو عنوان tbody = تعريف جسم الجدول tr / td = تعريف حقل بيانات داخل الجدول



// ------- S2 -------
// CSS Selectors =>> ننده بلعنصر الأساسي او اننا ننده بكلاس او اننا ننده ب أي دي او اننا ننده بل أب
// .class / #ID / Tag / parnt tag
// Outline =>> يستخدم لعمل إطار للعنصر بدون اخذ حيز من الصفحة
// border =>> يستخدم لعمل إطار للعنصر بأخذ حيز من الصفحة
// Visibility =>> تستخدم لإخفاء العناصر بلحفاظ على أماكنها hidden / visible
// Display =>> تستخدم لأخفاء عنصر مع حذف مكانه في الصفحة none وبتاخد قيم اخرى مثل felx / grid / block / inline / inline block
// Overflow =>> مسؤلة عن إخفاء باقي العنصر الخارج عن إطار الأب hidden = بتخفي الحاجه خالص scroll = بتظهر شريط تمرير auto = بتتعامل على حسب المحتوى الموجود
// Cursor =>> للتحكم في شكل الماوس عند الوقوف على العنصر
// Float and Clear =>> للتحكم في مكان العنصر يميم او شمال الصفحه مع القيمه clear
// CSS Calc =>>
// Opacity =>> للتحكم في شفافية العنصر


// ------- S3 -------

// Zindex =>> بتتحكم في الطبقه الخاصة بلعنصر بتاعي =>> Position
// List Styling =>> هي طريقه التحكم في شكل ترتيب العناصر في ال OL / UL
// Tables Styling =>> تصميم وتعديل على الجدول والصفوف والأعمده الخاصة بيه
// Position =>> static =>> القيمة الأساسية sticky =>> بتتحكم فمكان العنصر وتخليه ثابت فلصفحة بشرط محدد fixed =>> بتخلي العنصر ثابت بدون شورط فأي حته فلصفحة absolute=>> بيخليني اقدر اتحكم فمكان العنصر بلنسبه لليمين والشمال وفوق وتحت relative=>> بيخليني اتحكم في مكان العنصر يمين وشمال بس 
// Pseudo Elements =>> first line / selection / first letter / after / befor 
// Pseudo Classes =>> hover / active / empty / visited / foucs / disabeled / Enabled / requierd / invalid / valid / checked
// important =>> لتنفيذ كود تصميم وتنفيذه وتخطي جميع التصاميم الأخرى